Revit 2026 API

# FilteredWorksetCollectorWherePasses Method

---

Applies a workset filter to the collector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FilteredWorksetCollector WherePasses(
	WorksetFilter filter
)
```
```vb
Public Function WherePasses (
	filter As WorksetFilter
) As FilteredWorksetCollector
```
```cpp
public:
FilteredWorksetCollector^ WherePasses(
	WorksetFilter^ filter
)
```
```fsharp
member WherePasses :
        filter : WorksetFilter -> FilteredWorksetCollector
```

#### Parameters

filter WorksetFilter
     The workset filter.

#### Return Value

FilteredWorksetCollector A handle to this collector. This is the same collector that has just been modified, returned so you can chain multiple calls together in one line.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The filter will be added as an additional condition that all filtered worksets must pass. If you have an active iterator to this collector it will be stopped by this call.

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace